ipocsmr/ipocs/ocs/esp8266/ServerConnection.cpp
#include "ServerConnection.h"
#include "Configuration.h"
#include "../IPOCS/Message.h"
#include "../IPOCS/Packets/ConnectionRequestPacket.h"
#include "../IPC/Message.h"
#include "http.h"
#include "ArduinoConnection.h"
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>

esp::ServerConnection::ServerConnection() {
    this->tcp = new WiFiClient();
    this->udp = new WiFiUDP();
    this->udp->begin(10000);
}

esp::ServerConnection::~ServerConnection() {
    // this will never happen (as long as this class is a singleton) and generates warnings.
    //delete this->tcp;
    //delete this->udp;
}

esp::ServerConnection& esp::ServerConnection::instance() {
    static esp::ServerConnection _instance;
    return _instance;
}

void esp::ServerConnection::loop(bool isWiFiConnected) {
    if (!isWiFiConnected) {
        if (this->tcp->connected()) {
            this->tcp->stop();
        }
        return;
    }
    if (!this->tcp->connected()) {
        int packetSize = this->udp->parsePacket();
        if (packetSize == 0)
        {
            this->udp->beginPacket("255.255.255.255", 10000);
            this->udp->write("get server");
            this->udp->endPacket();
        }
        else
        {
            char packetBuffer[40];
            this->udp->read(packetBuffer, 40);

            IPAddress ip(packetBuffer[0], packetBuffer[1], packetBuffer[2], packetBuffer[3]);
            int port = (packetBuffer[4] << 8) + packetBuffer[5];
            byte returnVal = this->tcp->connect(ip, port);
            if (returnVal == 1)
            {
                IPOCS::Message* msg = IPOCS::Message::create();
                msg->RXID_OBJECT = String((char)Configuration::getUnitID());
                IPOCS::ConnectionRequestPacket* pkt = (IPOCS::ConnectionRequestPacket*)IPOCS::ConnectionRequestPacket::create();
                pkt->RM_PROTOCOL_VERSION = 0x0101;
                char sdVersion[10];
                int sdSize = sprintf(sdVersion, "%04X", Configuration::getSiteDataCrc());
                pkt->RXID_SITE_DATA_VERSION = String(sdVersion);
                msg->setPacket(pkt);
                this->send(msg);
                delete msg;
            }
            else
            {
            }
        }
    } else {
        while (this->tcp->available()) {
            // Read the header
            byte RL_MESSAGE = 0;
            int numRead = this->tcp->read(&RL_MESSAGE, 1);
            if (numRead != 1)
            {
                // Close connection - error in reading.
                this->tcp->stop();
                return;
            }
            // Define the message
            byte message[RL_MESSAGE];
            message[0] = RL_MESSAGE;
            // Read the rest of the message
            numRead += this->tcp->read(message + 1, RL_MESSAGE - 1);
            if (numRead != RL_MESSAGE)
            {
                // Close connection - error in reading.
                this->tcp->stop();
                return;
            }
            // Now parse it.
            IPOCS::Message* msg = IPOCS::Message::create(message);
            IPC::Message* ipcMsg = IPC::Message::create();
            ipcMsg->RT_TYPE = IPC::IPOCS;
            ipcMsg->setPayload(message, msg->RL_MESSAGE);
            ArduinoConnection::instance().send(ipcMsg);
            delete msg;
            delete ipcMsg;
        }
    }
}

void esp::ServerConnection::send(IPOCS::Message* msg)
{
  if (!this->tcp->connected())
  {
    esp::Http::instance().log("Not connected, throwing message");
    return;
  }
  uint8_t buffer[255];
  uint8_t len = msg->serialize(buffer);
  this->tcp->write(buffer, len);
}